//--створити масив та вивести його в консоль: ==========================================================================
// - з 5 числових значень ==============================================================================================
const arr1 = [1, 2, 3, 4, 5];

console.log(arr1);
console.log('==================================');
// - з 5 стічкових значень =============================================================================================
const arr2 = ['1', '2', '3', '4', '5'];

console.log(arr2);
console.log('==================================');
// - з 5 значень стрічкового, числового та булевого типу ===============================================================
const arr3 = ['2', '3', 1, false, 5];

console.log(arr3);
console.log('==================================');
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
let arr4 = [];

arr4[0] = 1;
arr4[1] = '2';
arr4[2] = '3';
arr4[3] = false;
arr4[4] = 5;

console.log(arr4);
console.log('==================================');
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині =====================
for (let i = 0; i < 10; i++) {
    document.write(`<div>Lorem ipsum dolor sit amet.</div>`);
}
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині ==========
for (let i = 0; i < 10; i++) {
    document.write(`<div>Index: ${i}</div>`);
}
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині. ===========================
let j1 = 0;

while (j1 < 20) {
    document.write(`<h1>Lorem ipsum dolor sit amet.</h1>`);
    j1++;
}
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині. ================
let j2 = 0;

while (j2 < 20) {
    document.write(`<h1>Index: ${j2}</h1>`);
    j2++;
}
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі. ==============================
const arr5 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

for (let i = 0; i < arr5.length; i++) {
    console.log(arr5[i]);
}
console.log('==================================');
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі. ============================
const arr6 = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10'];

for (let i = 0; i < arr6.length; i++) {
    console.log(arr6[i]);
}
console.log('==================================');
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі. =======================
const arr7 = [1, '2', 3, true, '5', 6, '7', false, 9, '10'];

for (let i = 0; i < arr7.length; i++) {
    console.log(arr7[i]);
}
console.log('==================================');
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
const arr8 = [1, '2', 3, true, '5', 6, '7', false, 9, '10'];

for (let i = 0; i < arr8.length; i++) {
    if (typeof arr8[i] === "boolean") {
        console.log(arr8[i]);
    }
}
console.log('==================================');
for (let i = 0; i < arr8.length; i++) {
    if (typeof arr8[i] === "number") {
        console.log(arr8[i]);
    }
}
console.log('==================================');
for (let i = 0; i < arr8.length; i++) {
    if (typeof arr8[i] === "string") {
        console.log(arr8[i]);
    }
}
console.log('=================================');
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів.
// Вивести в консоль всі його елементи в циклі.
let array1 = [];

array1[0] = 1;
array1[1] = '2';
array1[2] = '3';
array1[3] = false;
array1[4] = 5;
array1[5] = 7;
array1[6] = '4';
array1[7] = '6';
array1[8] = true;
array1[9] = 9;

for (let i = 0; i < array1.length; i++) {
    console.log(array1[i]);
}
console.log('=================================');
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write ====
for (let i = 0; i < 10; i++) {
    console.log('Step:', i);
    document.write(`Step: ${i} <br>`);
}
console.log('=================================');
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write ====
for (let i = 0; i < 100; i++) {
    console.log('Step:', i);
    document.write(`Step: ${i} <br>`);
}
console.log('=================================');
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write ====
for (let i = 0; i < 200; i += 2) {
    console.log('Step:', i);
    document.write(`Step: ${i} <br>`);
}
console.log('=================================');
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write =================
for (let i = 0; i < 100; i++) {
    if (i % 2 === 0) {
        console.log('Step:', i);
        document.write(`Step: ${i} <br>`);
    }
}
console.log('=================================');
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write ===============
for (let i = 0; i < 100; i++) {
    if (i % 2 !== 0) {
        console.log('Step:', i);
        document.write(`Step: ${i} <br>`);
    }
}
console.log('=================================');
// Додатково ===========================================================================================================
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово. ==================================
const array2 = [ 'a', 'b', 'c'];
let str1 = '';

for (let i = 0; i < array2.length; i++) {
    str1 = str1 + array2[i];
}
console.log(str1);
console.log('=================================');
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово. ================================
let j3 = 0;
let str2 = '';

while (j3 < array2.length) {
    str2 = str2 + array2[j3];
    j3++;
}
console.log(str2);
console.log('=================================');
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово. ===============================
let str3 = '';

for (let element of array2) {
    str3 = str3 + element;
}
console.log(str3);
console.log('=================================');
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for in зібрати всі букви в слово. ===============================
let str4 = '';

for (let element in array2) {
    str4 = str4 + array2[element];
}
console.log(str4);
console.log('=================================');
// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди) =========================
// let minutes = 0;
// let seconds = 1;
//
// while (seconds <= 60) {
//     if (seconds === 60) {
//         minutes++;
//         seconds = 0;
//     } else if (minutes === 2) {
//         break;
//     }
//     console.log(`Minutes: ${minutes}, seconds: ${seconds};`);
//     seconds++;
// }
// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди) =
let hours = 0;
let minutes = 0;
let seconds = 1;

while (seconds <= 60) {
    if (seconds === 60) {
        minutes++;
        seconds = 0;
    } else if (minutes === 60) {
        hours++;
        minutes = 0;
    } else if (hours === 2 && minutes === 20) {
        break;
    } else if (hours === 0) {
        console.log(`Minutes: ${minutes}, seconds: ${seconds};`);
        seconds++;
    } else {
        console.log(`Hours: ${hours}, minutes: ${minutes}, seconds: ${seconds};`);
        seconds++;
    }
}

